"""
1.แสดงการใช้ฟังค์ชั่น input() รับข้อมูลผ่านทางคีย์บอร์ด
2.แสดงการใช้ฟังค์ชั่น print() แสดงผลข้อมูล

"""
"""
first_name = input("กรุณาป้อนชื่อของคุณ : ")
last_name = input("กรุณาป้อนนามสกุลของคุณ : ")
age = input("กรุณาป้อนอายุของคุณ : ")
address = input("กรุณาป้อนที่อยู่ของคุณ : ")
education = input("กรุณาป้อนประวัติการศึกษา : ")
career = input("กรุณาป้อนอาชีพ : ")
favourite = input("กรุณาป้อนสิ่งที่ตัวเองชอบ : ")
not_like = input("กรุณาป้อนสิ่งที่ไม่ชอบ : ")
print("------------------------------------")
print("ชื่อของคุณ คือ :", first_name)
print("นามสกุลของคุณคือ :", last_name)
print("อายุของคุณคือ :", age)
print("ที่อยู่ของคุณคือ :", address)
print("ประวัติการศึกษาของคุณคือ :", education)
print("อาชีพของคุณคือ :", career)
print("สิ่งที่คุณชอบคือ :", favourite)
print("สิ่งที่คุณไม่ชอบคือ :", not_like)
"""

"""
การประกาศตัวแปร
ภาษษไพธอนไม่จำเป็นต้องกำหนดชนิดข้อมูลให้กับตัวแปร ตัวแปรที่ประกาศสร้างขึ้นมาใช้งาน
จะกำหนดค่าข้อมูลไว้ 
ในภาษาไพธอน เวอร์ชั่น 3 สามารถสร้างตัวแปรเป็นภาษาไทยได้
"""
"""
msg = "Python Programming" #ประกาศตัวแปร msg เป็นข้อมูลสายอัขระหรือ สตริง (String)
num = 2415 #ประกาศตัวแปร NUM เป็นข้อมูลชนิดจำนวนเต็ม (Integer)
score = 78.54 #ประกาศตัวแปร score เป็นชนิดข้อมูลทศนิยม (float)
grad = "" #ประกาศตัวแปร grad เก็บค่าว่าง
ปากกา = "สีแดง"
โทรศัพท์ = "Samsung"
print("ปากกา สี = ", ปากกา)
print("โทรศัพท์ ยี่ห้อ =", โทรศัพท์)
"""

"""
ตัวแปรชนิดค่าคงที่ ค่าคงที่คือ ตัวแปรที่สร้างขึ้นมาเก็บค่าข้อมูลที่จะไม่มีการเปลียนแปลง
ค่าในระหว่างการประมวลผล

"""
"""
pi = 3.14
area = pi * 5 * 5
circumference = 2 * pi * 10
print("พื้นที่วงกลม = ", area)
print("เส้นรอบวงกลม = ",circumference)
"""

"""
ชนิดข้อมูลจำนวนเต็ม ( Integer )
ชนิดข้อมูลจำนวนเต็มประกอบไปด้วยตัวเลขจำนวนเต็มบวกและตัวเลขจำนวนเต็มลบ
ในภาษาไพธอนไม่ได้กำหนดความยาวของชนิดข้อมูลจำนวนเต็ม นั้นหมายความว่าเราสามารถประกาศตัวแปรเก็บชนิดข้อมูลจำนวนเต็มให้มีความยาวเท่าไหร่ก็ได้
"""
"""
num1 = 99999; num2 = 77777;
print("ผลบวกของ num1 กับ num2 = ", num1 + num2);
print("ผลลบของ num1 กับ num2 = ", num1 - num2);
"""

"""
การแปลงเลขฐานสิบเป็นเลขฐานสอง ฐานแปดและฐานสิบหก
"""
"""
x = 6749
print("แปลงเลขฐานสิบเป็นฐานสอง = ", bin(x))
print("แปลงเลขฐานสิบเป็นฐานแปด =", oct(x))
print("แปลงเลขฐานสิบเป็นฐานสิบหก = ", hex(x))
"""

"""
การแปลงเลขฐานสอง ฐานแปด และฐานสิบหก เป็นเลขฐานสิบ
"""
"""
a = 0b100111011001
b = 0o6453
c = 0xAC41
print("แปลงเลขฐานสองเป็นฐานสิบ =", int(a))
print("แปลงเลขฐานแปดเป็นฐานสิบ =", int(b))
print("แปลงเลขฐานสิบหกเป็นฐานสิบ =", int(c))
"""

"""
การบวกเลขฐานสองและการแปลงผลลัพธ์จากการบวกเลขฐานสองเป็น ฐานสิบ
ฐานสอง ฐานแปด และ ฐานสิบหก
"""
"""
a = 0b1001011; b = 0b1101101
c = a + b
print("ผลบวกของ a กับ b =", c)
print("แปลงผลลัพธ์จากการบวก a กับ b เป็นเลขฐานสอง =", bin(c))
print("แปลงผลลัพธ์จากการบวก a กับ b เป็นเลขฐานแปด =", oct(c))
print("แปลงผลลัพธ์จากการบวก a กับ b เป็นเลขฐานสิบหก =", hex(c))
"""

"""
ชนิดข้อมูลจำนวนทศนิยม (Float)
ชนิดข้อมูลประเภทนี้ประกอบไปด้วยตัวเลข 2 ส่วน โดยมีเครื่องหมายจุด (.) คั่นระหว่างตัวเลขที่อยู่ด้านหน้า
และด้านหลัง ตัวเลขด้านหน้าเป็นตัวเลขจำนวนเต็ม และตัวเลขที่อยู่ด้านหลังจุดเรียกว่า ทศนิยม
แบบที่สอง E และ e ซึ้งเป็นการเขียนในรูปแบบของเลขยกกำลังสิบ (Exponential Form)

"""
"""
a = 341.451E-3; b = 251.147e-2; c = 758.457E5; x = 10.5; y = 17.5
d = a - b
z = x + y
print("ค่าตัวเลขจำนวนทศนิยมของ b = ", b)
print("ผลลัพธ์จากการลบ a กับ b = ", d)
print("ผลลัพธ์จากการบวก x กับ y = ", z)
"""

"""
ในกรณีที่ต้องการแปลงชนิดข้อมูลจำนวนเต็ม ให้เป็นชนิดข้อมูลจำนวนทศนิยม ให้ใช้ฟังค์ชั่น float()
"""
"""
a = 56
b = 55
c = float(a)
d = float(b)
x = c + d
y = c * d
print("ผลลัพธ์จากการแปลงค่า 56 = ", c)
print("ผลลัพธ์จากการแปลงค่า 55 = ", d)
print("ผลลัพธ์จากการแปลงค่า c + d = ", x)
print("ผลลัพธ์จากการแปลงค่า c * d = ", y)
"""





