"""
1.แสดงการใช้ฟังค์ชั่น input() รับข้อมูลผ่านทางคีย์บอร์ด
2.แสดงการใช้ฟังค์ชั่น print() แสดงผลข้อมูล

"""
first_name = input("กรุณาป้อนชื่อของคุณ : ")
last_name = input("กรุณาป้อนนามสกุลของคุณ : ")
age = input("กรุณาป้อนอายุของคุณ : ")
address = input("กรุณาป้อนที่อยู่ของคุณ : ")
education = input("กรุณาป้อนประวัติการศึกษา : ")
career = input("กรุณาป้อนอาชีพ : ")
favourite = input("กรุณาป้อนสิ่งที่ตัวเองชอบ : ")
not_like = input("กรุณาป้อนสิ่งที่ไม่ชอบ : ")
print("------------------------------------")
print("ชื่อของคุณ คือ :", first_name)
print("นามสกุลของคุณคือ :", last_name)
print("อายุของคุณคือ :", age)
print("ที่อยู่ของคุณคือ :", address)
print("ประวัติการศึกษาของคุณคือ :", education)
print("อาชีพของคุณคือ :", career)
print("สิ่งที่คุณชอบคือ :", favourite)
print("สิ่งที่คุณไม่ชอบคือ :", not_like)