"""
1.แสดงการใช้ฟังค์ชั่น input() รับข้อมูลผ่านทางคีย์บอร์ด
2.แสดงการใช้ฟังค์ชั่น print() แสดงผลข้อมูล

"""
"""
first_name = input("กรุณาป้อนชื่อของคุณ : ")
last_name = input("กรุณาป้อนนามสกุลของคุณ : ")
age = input("กรุณาป้อนอายุของคุณ : ")
address = input("กรุณาป้อนที่อยู่ของคุณ : ")
education = input("กรุณาป้อนประวัติการศึกษา : ")
career = input("กรุณาป้อนอาชีพ : ")
favourite = input("กรุณาป้อนสิ่งที่ตัวเองชอบ : ")
not_like = input("กรุณาป้อนสิ่งที่ไม่ชอบ : ")
print("------------------------------------")
print("ชื่อของคุณ คือ :", first_name)
print("นามสกุลของคุณคือ :", last_name)
print("อายุของคุณคือ :", age)
print("ที่อยู่ของคุณคือ :", address)
print("ประวัติการศึกษาของคุณคือ :", education)
print("อาชีพของคุณคือ :", career)
print("สิ่งที่คุณชอบคือ :", favourite)
print("สิ่งที่คุณไม่ชอบคือ :", not_like)
"""

"""
การประกาศตัวแปร
ภาษษไพธอนไม่จำเป็นต้องกำหนดชนิดข้อมูลให้กับตัวแปร ตัวแปรที่ประกาศสร้างขึ้นมาใช้งาน
จะกำหนดค่าข้อมูลไว้ 
ในภาษาไพธอน เวอร์ชั่น 3 สามารถสร้างตัวแปรเป็นภาษาไทยได้
"""
"""
msg = "Python Programming" #ประกาศตัวแปร msg เป็นข้อมูลสายอัขระหรือ สตริง (String)
num = 2415 #ประกาศตัวแปร NUM เป็นข้อมูลชนิดจำนวนเต็ม (Integer)
score = 78.54 #ประกาศตัวแปร score เป็นชนิดข้อมูลทศนิยม (float)
grad = "" #ประกาศตัวแปร grad เก็บค่าว่าง
ปากกา = "สีแดง"
โทรศัพท์ = "Samsung"
print("ปากกา สี = ", ปากกา)
print("โทรศัพท์ ยี่ห้อ =", โทรศัพท์)
"""

"""
ตัวแปรชนิดค่าคงที่ ค่าคงที่คือ ตัวแปรที่สร้างขึ้นมาเก็บค่าข้อมูลที่จะไม่มีการเปลียนแปลง
ค่าในระหว่างการประมวลผล

"""
pi = 3.14
area = pi * 5 * 5
circumference = 2 * pi * 10
print("พื้นที่วงกลม = ", area)
print("เส้นรอบวงกลม = ",circumference)
